<?php

return [
    'actions' => 'کردارەکان',
    'add' => 'زیادکردن',
    'cancel' => 'پەشیمانبونەوە',
    'create' => 'زیادکردن',
    'delete' => 'سڕینەوە',
    'edit' => 'دەستکاری',
    'new' => 'نوێ',
    'reset' => 'ڕێکخستنەوە',
    'save' => 'پاشەکەوتکردن',
    'saved' => 'پاشەکەوتکرا',
    'show' => 'پیشاندان',
    'swap' => 'جێگرەوە',
    'save-and-stay' => 'پاشەکەوتکردن و مانەوە',
    'save-go-back' => 'پاشەکەوتکردن و گەڕانەوە',

    'cropper' => [
        'select-file' => 'هەڵبژاردنی پەڕگە',
        'drop-zone-help' => 'وێنەیەک ڕابکێشە ئێرە یان کرتە بکە لەسەر ئەم ناوچەیە',
        'file-info' => 'PNG, JPG, GIF, TIFF, زۆرترین 1.5MB',
    ],

    'file-upload' => [
        'upload-file-error' => 'یەکێک یان زیاتر لە پەڕگە بارکراوەکان هاوتا نەبوون لەگەڵ پەڕگەی ڕێگەپێدراو یان سنووری قەبارە. تکایە سەیری خانەکانی دەقی یارمەتی بکە، چاو بە پەڕگەکانتدا بخشێنەوەو دووبارە هەوڵ بدەرەوە.'
    ],

    'select' => [
        'placeholder' => 'تکایە بژاردەیەک هەڵبژێرە...',
    ],

    'multiselect' => [
        'placeholder' => 'تکایە بژاردەیەک یان زیاتر هەڵبژێرە ...',
        'help' => 'فشار لە CTRL(Windows) یاخود CMD(Mac), بۆ هەڵبژاردنی/لابردنی بژاردەیەک.',
    ],

    'search' => [
        'placeholder' => 'گەڕان ...', //used for both Search and SearchList fields
    ],

    'alerts' => [
        'size-limit' => 'پەڕگەکە زۆر گەورەیە.',
        'one-at-the-time' => 'تکایە تەنها یەک پەڕگە هاوکات باربکە.',
        'max-attachments' => 'زۆرترین هاوپێچی رێگەپێدراو هاوپێچەکان: ',
        'mime' => 'جۆری پەڕگەکە نادروستە، تکایە پەڕگەیەکی تر هەڵبژێرە.',
        'updated-success' => 'فۆرمەکە بەسەرکەوتوویی پاشەکەوت کرا',
        'are-u-sure' => 'ئایا دڵنیایت؟',
        'tampering' => 'زانرا! بەهای بێ مۆڵەت دەستکاری دەکات', //if someone tampers with read-only values in Livewire devtools or console
    ],

    'spatie-tags' => [
        'error-msg' => 'تاگەکە دەبێت لە نێوان ٣ بۆ ٦٠ نووسە درێژ بێت و تەنیا لە پیتی ئەلفا-ژمارەیی پێکبێت.',
        'placeholder' => 'بنووسە بۆ زیادکردن/گەڕان ...',
        'help' => 'فشار لە دووگمەی SPACE بۆ زیادکردنی تاگی نوێ, یاخود تاگێکی هەبوو هەڵبژێرە بەکرتەکردن لەسەری.',
    ],

    'tags' => [
        'placeholder' => 'لێرە بنوسە...',
        'help' => 'فشار لە دووگمەی ENTER بکە, کۆما یان بۆشایی, بۆ زیادکردنی تاگ',
        'error-msg' => 'تاگەکە دەبێت لە نێوان ٣ بۆ ٢٥ نووسە درێژ بێت و تەنیا لە پیتی ئەلفا-ژمارەیی پێکبێت.',
    ],

    'tags-search' => [
        'placeholder' => 'بنووسە بۆ زیادکردن/گەڕان ...',
        'help' => 'نوسینی ENTER، کۆما یان بۆشایی، بۆ زیادکردنی تاگێکی نوێ، یان دیاریکردنی تاگێکی بەردەست لەڕێگای کرتەکردن لەسەری.',
        'error-msg' => 'تاگەکە دەبێت لە نێوان ٣ بۆ ٢٥ نووسە درێژ بێت و تەنیا لە پیتی ئەلفا-ژمارەیی پێکبێت.',
    ],

    'date-picker' => [
        'placeholder' => 'بەروار دیاریبکە...',
        'save-btn' => 'پاشەکەوتکردن'
    ],


];
